practice-for-ch-js-ajax-twitter-long-practice-main/app/controllers/follows_controller.rb

INSERT INTO "follows" ("follower_id", "following_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["follower_id", 1], ["following_id", 22], ["created_at", "2022-08-10 20:49:04.941503"], ["updated_at", "2022-08-10 20:49:04.941503"]]
---
  def create
    # simulate latency
    sleep(1)

    follow = current_user.out_follows.create!(following_id: params[:user_id])

DELETE FROM "follows" WHERE "follows"."id" = $1  [["id", 169]]
---
  def destroy
    # simulate latency
    sleep(1)

    follow = current_user.out_follows.find_by(following_id: params[:user_id])
    follow.destroy!